TECHNICAL
4. Explain shift hand over and take over and job priorities.
6. Tank hand over to Maintenance
7. Pump hand over to Maintenance.
8. Draw a plant loop like P&ID.
10. What is surge in pumps and compressors?
16. Explain cavitation in pumps
17. What is absolute pressure and gauge pressure.
18. Start-up of pumps and compressors
21. What is Emergency shut down system how it will work
Viscosity units
PH
Anode Protection and Cathode protection
Flash point
ignition temperature
auto ignition temperature (H2s and Methand)
Filteration types
absolute temperature
dew point & atmospheric dewpoint
types of heat transfers (convection, conduction, radiation)
joule thomson effect
specific heat & latent heat
corrosion, types of corrosion and preventive methods
startup of centrifugal compressor
steam at different levels (saturated, superheated etc)
DCS basics
Controller types
flow rate
calorific value
purpose of lubrication
density units
conversion of units







PROCESS
What is the purpose of de-butanizer?
What is the function of turbo expander?
What is the difference between absorption and adsorption?
How to avoid hammering in steam header?
15. Define vapour pressure



HSE
1. Define PTW and types of permit used in your industry and Importance of permits.
2. Explain responsibilities of each person in PTW, hazards and controls and explain JSA.
9. In case of fire what is your action
11. What are the requirements of hot job, confined space, working at height
22. What is LEL, UEL and IDLH
23. What will be LEL required for welding and grinding job
24. What will be the requirements for confined jobs
25. Preparation of Equipment like pump, tank or pipeline for hot job.
minimum requirement of oxygen
TLV, STEL and IDLH of Hydrogen sulphide
how to prepare equipment for Hot work
precaution of excavation permit




OTHER
3. Introduce your-self.
13. Share the emergency scenario in your industry
5. What are your job responsibilities
12. Any appreciation from the management
14. Activities during shift
20. What will be your action when your boss give you urgent assignment and some critical safety issue in the plant, how you priorties.

